garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1566.PIC
        <edc:JoinedSFRDef edc:cname="FSR0" edc:desc="" edc:name="FSR0" edc:nzwidth="0x10" edc:_addr="0x4">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0L" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0L" edc:desc="" edc:mask="0xff" edc:name="FSR0L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="FSR0H" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0H" edc:desc="" edc:mask="0xff" edc:name="FSR0H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="FSR1" edc:desc="" edc:name="FSR1" edc:nzwidth="0x10" edc:_addr="0x6">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR1L" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1L" edc:desc="" edc:mask="0xff" edc:name="FSR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="FSR1H" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x7">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1H" edc:desc="" edc:mask="0xff" edc:name="FSR1H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="BSR" edc:nzwidth="8" edc:por="---00000" edc:_addr="0x8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:mask="0x1f" edc:name="BSR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BSR0" edc:desc="" edc:mask="0x1" edc:name="BSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BSR1" edc:desc="" edc:mask="0x1" edc:name="BSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BSR2" edc:desc="" edc:mask="0x1" edc:name="BSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BSR3" edc:desc="" edc:mask="0x1" edc:name="BSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BSR4" edc:desc="" edc:mask="0x1" edc:name="BSR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:mask="0xff" edc:name="WREG0" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PCLATH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PCLATH" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0xA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH" edc:desc="" edc:mask="0x7f" edc:name="PCLATH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnr" edc:cname="INTCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="INTCON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCIF" edc:desc="Interrupt-on-Change Interrupt Flag" edc:mask="0x1" edc:name="IOCIF" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="When at least one of the interrupt-on-change pins changed state" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="None of the interrupt-on-change pins have changed state" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTF" edc:desc="INT External Interrupt Flag" edc:mask="0x1" edc:name="INTF" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="The INT external interrupt occurred" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="The INT external interrupt did not occur" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:desc="Timer0 Overflow Interrupt Flag" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="TMR0 register has overflowed" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="TMR0 register did not overflow" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="IOCIE" edc:desc="Interrupt-on-Change Enable" edc:mask="0x1" edc:name="IOCIE" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enables the interrupt-on-change" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables the interrupt-on-change" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTE" edc:desc="INT External Interrupt Enable" edc:mask="0x1" edc:name="INTE" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enables the INT external interrupt" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables the INT external interrupt" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:desc="TMR0 Overflow Interrupt Enable" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="1">
                <edc:SFRFieldSemantic edc:desc="Enables the TMR0 interrupt" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables the TMR0 interrupt" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PEIE" edc:desc="Peripheral Interrupt Enable" edc:mask="0x1" edc:name="PEIE" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enables all unmasked peripheral interrupts" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables all peripheral interrupts" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="GIE" edc:desc="Global Interrupt Enable" edc:mask="0x1" edc:name="GIE" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:desc="Enables all unmasked interrupts" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:SFRFieldSemantic edc:desc="Disables all interrupts" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T0IF" edc:desc="" edc:mask="0x1" edc:name="T0IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T0IE" edc:desc="" edc:mask="0x1" edc:name="T0IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
