garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1566.PIC
        <edc:SFRDef edc:access="-nnn----" edc:cname="AD1CON2" edc:desc="" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000----" edc:name="AD1CON2" edc:nzwidth="8" edc:por="-000----" edc:_addr="0x713">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON2"/>
            <edc:LegacyAlias edc:cname="AAD1CON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:desc="" edc:mask="0x7" edc:name="TRIGSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL0" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL1" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL2" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="AD1CON3" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="AD1CON3" edc:nzwidth="8" edc:por="00----00" edc:_addr="0x714">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON3"/>
            <edc:LegacyAlias edc:cname="AAD1CON3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD1DSEN" edc:desc="" edc:mask="0x1" edc:name="AD1DSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1IPEN" edc:desc="" edc:mask="0x1" edc:name="AD1IPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="AD1IPPOL" edc:desc="" edc:mask="0x1" edc:name="AD1IPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1EPPOL" edc:desc="" edc:mask="0x1" edc:name="AD1EPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:desc="" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADIPPOL" edc:desc="" edc:mask="0x1" edc:name="ADIPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADEPPOL" edc:desc="" edc:mask="0x1" edc:name="ADEPPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-rrr" edc:cname="ADSTAT" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="ADSTAT" edc:nzwidth="8" edc:por="-000-000" edc:_addr="0x715">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADSTAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD1STG" edc:desc="" edc:mask="0x3" edc:name="AD1STG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AD1CONV" edc:desc="" edc:mask="0x1" edc:name="AD1CONV" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AD2STG" edc:desc="" edc:mask="0x3" edc:name="AD2STG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AD2CONV" edc:desc="" edc:mask="0x1" edc:name="AD2CONV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTG" edc:desc="" edc:mask="0x3" edc:name="ADSTG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ADCONV" edc:desc="" edc:mask="0x1" edc:name="ADCONV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AD1STG0" edc:desc="" edc:mask="0x1" edc:name="AD1STG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD1STG1" edc:desc="" edc:mask="0x1" edc:name="AD1STG1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AD2STG0" edc:desc="" edc:mask="0x1" edc:name="AD2STG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AD2STG1" edc:desc="" edc:mask="0x1" edc:name="AD2STG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1PRECON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1PRECON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x716">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADPRE"/>
            <edc:LegacyAlias edc:cname="AD1PRE"/>
            <edc:LegacyAlias edc:cname="AAD1PRE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPRE" edc:desc="" edc:mask="0x7f" edc:name="ADPRE" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPRE0" edc:desc="" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE1" edc:desc="" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE2" edc:desc="" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE3" edc:desc="" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE4" edc:desc="" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE5" edc:desc="" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE6" edc:desc="" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1ACQCON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1ACQCON" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x717">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADACQ"/>
            <edc:LegacyAlias edc:cname="AD1ACQ"/>
            <edc:LegacyAlias edc:cname="AAD1ACQ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACQ" edc:desc="" edc:mask="0x7f" edc:name="ADACQ" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACQ0" edc:desc="" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ1" edc:desc="" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ2" edc:desc="" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ3" edc:desc="" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ4" edc:desc="" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ5" edc:desc="" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ6" edc:desc="" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
