garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1566.PIC
        <edc:SFRDef edc:access="nnn----n" edc:cname="AD1GRD" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="AD1GRD" edc:nzwidth="8" edc:por="000----0" edc:_addr="0x718">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADGRD"/>
            <edc:LegacyAlias edc:cname="AAD1GRD"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX1POL" edc:mask="0x1" edc:name="TX1POL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="GRD1POL" edc:desc="" edc:mask="0x1" edc:name="GRD1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD1AOE" edc:desc="" edc:mask="0x1" edc:name="GRD1AOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRD1BOE" edc:desc="" edc:mask="0x1" edc:name="GRD1BOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXPOL" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="GRDPOL" edc:desc="" edc:mask="0x1" edc:name="GRDPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDAOE" edc:desc="" edc:mask="0x1" edc:name="GRDAOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDBOE" edc:desc="" edc:mask="0x1" edc:name="GRDBOE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="AD1CAPCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="AD1CAPCON" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x719">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCAP"/>
            <edc:LegacyAlias edc:cname="AAD1CAP"/>
            <edc:LegacyAlias edc:cname="AAD1CAPCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDCAP" edc:desc="" edc:mask="0xf" edc:name="ADDCAP" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCAP" edc:desc="" edc:mask="0xf" edc:name="ADCAP" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADDCAP0" edc:desc="" edc:mask="0x1" edc:name="ADDCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP1" edc:desc="" edc:mask="0x1" edc:name="ADDCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP2" edc:desc="" edc:mask="0x1" edc:name="ADDCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP3" edc:desc="" edc:mask="0x1" edc:name="ADDCAP3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ADD1CAP" edc:desc="" edc:mask="0xf" edc:name="ADD1CAP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AAD1RES0" edc:desc="" edc:name="AAD1RES0" edc:nzwidth="0x10" edc:_addr="0x71A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD1RES0"/>
            <edc:LegacyAlias edc:cname="ADRES0"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD1RES0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD1RES0L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x71A">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AD1RES0L"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD1RES0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD1RES0H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x71B">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AD1RES0H"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AAD1RES1" edc:desc="" edc:name="AAD1RES1" edc:nzwidth="0x10" edc:_addr="0x71C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD1RES1"/>
            <edc:LegacyAlias edc:cname="ADRES1"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD1RES1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD1RES1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x71C">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AD1RES1L"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD1RES1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD1RES1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x71D">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AD1RES1H"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AD1CH" edc:desc="" edc:name="AD1CH" edc:nzwidth="0x10" edc:_addr="0x71E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD1CH"/>
          </edc:AliasList>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD1CH0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AD1CH0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x71E">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AAD1CH0"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CH10" edc:desc="" edc:mask="0x1" edc:name="CH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH11" edc:desc="" edc:mask="0x1" edc:name="CH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH12" edc:desc="" edc:mask="0x1" edc:name="CH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH13" edc:desc="" edc:mask="0x1" edc:name="CH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH14" edc:desc="" edc:mask="0x1" edc:name="CH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH15" edc:desc="" edc:mask="0x1" edc:name="CH15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH16" edc:desc="" edc:mask="0x1" edc:name="CH16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CHS17" edc:mask="0x1" edc:name="CHS17" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="0x7"/>
                <edc:SFRFieldDef edc:cname="CH17" edc:mask="0x1" edc:name="CH17" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="AD1CH1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="AD1CH1" edc:nzwidth="8" edc:por="------00" edc:_addr="0x71F">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="AAD1CH1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CH18" edc:desc="" edc:mask="0x1" edc:name="CH18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CH19" edc:desc="" edc:mask="0x1" edc:name="CH19" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x78C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AD2CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AD2CON0" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x791">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3f" edc:name="CHS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AD2ON" edc:mask="0x1" edc:name="AD2ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS5" edc:mask="0x1" edc:name="CHS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE2" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
